/*
 *  배열
 *    장점 
 *    	간단한 구현:배열의 데이터저장 구조> 단순하다
 *    	고정된 크기:메모리의 사용량을 에측 > 메모리관리가 쉽다
 *    단점
 *    	고정된 크기:추가,삭제시에 어렵다(비용이 많이 들어간다)
 *    	메모리 낭비:크게 만들면(사용이 없는 메모리)/적게 만들면 데이터 추가 저장이 어렵다
 *    	같은데이터형만 저장:유연성이 떨어짐
 *    배열선언
 *    	데이터형[]  배열명
 *    	  ㄴ데이터형  ㄴ식별자
 *    초기화
 *    	선언과 동시에 초기화
 *    	  데이터형[] 배열명={값,값,값} > 명시적 초기화
 *    	default값 생성
 *    	  데이터형[] 배열명=new 데이터형[갯수]
 *    반복문을 이용 출력 방법
 *    	for(변수선언:배열명)
 *    		ㅣ		ㄴ저장위치
 *    		ㅣ_ 배열에 실제 저장된 값을 받음/인덱스를 이용하지 않고 실제 저장된 값 이용/자동으로 종료/배열범위 초과시에 오류 발생
 *    	for-each(향상된 for)-브라우저 화면UI
 *    저장위치가 다르다
 *    	int[] arr={10,20,30}
 *    	
 *    		---arr---		------------
 *    
 *    		---------   	------------
 */	  
 
public class 배열_10 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	
	}

}
